const MODEL_DICT = { "UW3": { "់": 1457, "្": -4234, "ង": 1076, "ី": 507, "យ": 275, "ប": -522, "។": 2971, "ៅ": 1237, "ា": -289, "ះ": 526, "ិ": -1199, "ុ": -862, "ដ": -528, "ោ": -1392, "ៃ": 1012, "ក": 218, "េ": -629, "ត": 342, "\"": 2081, "ំ": -767, "ល": 132, "ូ": -537, "ួ": -1142, "រ": -118, "៍": 1210, "អ": -760, "ស": -155, "ទ": -143, "៏": 988, "ម": 171, "ញ": 544, "ន": 126, "(": 1023, "ឹ": -670, "ៈ": 462, "ជ": -209, "័": -575, "ឺ": 114, "វ": -115, "0": 134, "ៗ": 274, "ឬ": 198, "ឧ": -156, "ៀ": -50, "ភ": -63, "-": 12 }, "UW5": { "ា": 634, "្": 406, "េ": 664, "ិ": 526, "ោ": 1070, "់": -3189, "ៅ": 1372, "ើ": 1067, "ស": -574, "រ": -275, "ំ": 898, "ែ": 634, "៉": 976, "ន": -77, "ត": -297, "យ": -102, "ី": 255, "ូ": 539, "ក": -55, "ឹ": 781, "ួ": 469, "ៃ": 613, "ុ": 470, "ព": -358, "ប": -374, "អ": -544, "ច": -360, "ជ": -507, "៊": 393, "៏": 999, "៍": -1251, "ឺ": 117, "ៀ": 491, "ដ": -359, "។": -358, "ញ": 421, "គ": -154, "ខ": -192, "ផ": -228, "ង": 99, "ល": -42, "ឿ": 200, "ឆ": -130, "ណ": 25, "ធ": -25, "ថ": -12 }, "UW4": { "ា": -4668, "្": -4350, "ប": 497, "ដ": 514, "ង": -2045, "អ": 1060, "់": -3540, "។": 3655, "ិ": -3195, "ី": -2928, "ុ": -3246, "ក": 235, "ព": 392, "េ": -2886, "ស": 397, "ំ": -2517, "ជ": 461, "ទ": 392, "ោ": -2683, "គ": 585, "ើ": -2600, "ែ": -2423, "ូ": -2495, "\"": 2316, "ច": 493, "ម": 296, "៉": -2774, "រ": 172, "ួ": -2320, "ថ": 736, "ណ": -817, "ផ": 905, "ខ": 544, "ៅ": -2072, "ះ": -1176, "៊": -1676, "ៃ": -1667, "ភ": 344, "ឹ": -1831, "ឆ": 213, "ត": -266, "ញ": -648, ")": 1618, "1": 626, "2": 578, "ឈ": 489, "ឯ": 811, "ល": -162, "(": 1182, "័": -1189, "ហ": 47, "ន": -269, "ៗ": 1111, "ឺ": -743, "វ": 21, "ឡ": -264, "ឬ": 700, "0": -556, "៍": -648, "យ": -111, "ៀ": -692, "-": 508, "ឧ": 165, "ឲ": 115 }, "UW2": { "ា": 673, "ោ": 799, "ុ": 810, "េ": 638, "ួ": 1007, "រ": -370, "ែ": 735, "្": 328, "ក": -394, "ើ": 926, "ិ": 596, "ម": -333, "ូ": 689, "ប": -157, "ង": -515, "អ": -893, "់": -524, "ថ": 149, "ច": -292, "ស": -289, "ល": -234, "ត": 52, "ដ": -182, "ន": -145, "ឹ": 493, "គ": 70, "៊": -415, "ៀ": 430, "័": 501, "ណ": 167, "ំ": -81, "ធ": 86, "ព": -277, "ភ": -255, "ី": 60, "0": 85, "វ": -139, "ឋ": -279, "ះ": -78, "ហ": -12, "។": -50, "ឿ": 12 }, "UW6": { "ា": -525, "រ": 144, "ន": 160, "ង": 169, "ល": 93, "យ": 326, "ក": 156, "ះ": 404, "្": 331, "េ": -553, "ី": -381, "ម": 217, "វ": 139, "ព": 92, "ើ": -356, "ិ": -144, "់": 426, "ច": 188, "ែ": -111, "ៅ": -391, "ដ": -94, "ឋ": -521, "ៈ": 245, "ោ": -27, "។": -66, "ខ": 26, "ស": -24, "ប": -13, "៍": -101 }, "BW1": { "ាន": 655, "្រ": -340, "ជា": 1189, "ថា": 1537, "បា": -1057, "ារ": 389, "តិ": 1382, "្យ": 470, "គេ": 1336, "ពី": 1030, "តែ": 1187, "ែល": 234, "ដែ": -933, "លើ": 703, "ស់": 206, "ទី": 471, "វា": 634, "ុំ": 701, "្ន": -525, "ជន": 555, "មក": 357, "នៃ": 790, "នៅ": 224, "ខែ": 451, "ធិ": 242, "៊ី": -197, "នា": 258, "្ស": 213, "អា": -482, "បី": 460, "ាក": -260, "ាំ": 206, "មា": -375, "ញា": 319, "ករ": 305, "ីរ": 103, "្ធ": 87, "ួន": 229, "្ឋ": 155, "ឡា": 27, "តុ": 249, "វី": -14, "រី": 39, "និ": -90, "យុ": 51, "ទេ": 63, "ង់": -25, "បទ": 75, "ុយ": -75, "ធំ": 74, "េស": 12 }, "UW1": { "ដ": 446, "ម": 178, "ា": -70, "ន": 164, "ទ": 177, "អ": -572, "្": 260, "ល": 150, "ថ": -110, "ជ": -93, "គ": -175, "ព": 19, "ៅ": 159, "ត": 48, "ង": -33, "៉": -136, "ី": 61, "ខ": -144, "ភ": 16, "េ": 55, "ើ": -54, "ធ": -67, "ផ": -146, "័": -130, "0": 25, "ែ": -12, "ញ": 12 }, "TW4": { "របស": 2418, "ដែល": 1448, "បាន": 706, "ត្រ": 988, "នេះ": 1159, "និង": 1513, "ប្រ": 391, "រដ្": 1403, "ក្ន": 628, "លោក": 1073, "ការ": 129, "ធ្វ": 553, "ជំទ": -1025, "ម្ន": 979, "មិន": 500, "យន្": 601, "នាក": 368, "ក្រ": 268, "បន្": 341, "ម្ម": -408, "ត្ត": -388, "ពារ": -412, "យ៉ា": 251, "ទាំ": 152, "មនុ": 190, "តាម": 204, "ព្រ": 79, "នូវ": 74, "ក្ស": -24, "ស្ស": -12 }, "BW3": { "ន្": -1662, "ម្": -1011, "និ": 622, "ពី": 565, "ដ្": -1185, "នៅ": 1210, "សម": 583, "នៃ": 1718, "ជា": 169, "រប": 460, "ឆ្": 883, "គឺ": 832, "បស": -822, "ទ្": -527, "នឹ": 632, "ខ្": 211, "ស្": -153, "មិ": 63, "តិ": -293, "សា": -40, "មន": 112, "ថា": 300, "វិ": 94, "ដា": -343, "មក": 199, "ទី": 98, "ពា": -34, "កា": 120, "អ្": 384, "ញ្": -346, "ណា": 287, "ពេ": 54, "នា": 62, "ជន": 66, "ដែ": 26, "សហ": 105, "ទំ": -102, "នុ": -75, "ទទ": 51, "មួ": 38, "លើ": 36, "ឯក": 12, "ជ្": -12 }, "TW1": { "បាន": 1204, "ប្រ": -2552, "នាំ": 1237, "ដែល": 856, "្វើ": 619, "ាយុ": 903, "បស់": 828, "មាន": 305, "្នក": 263, "្ធិ": 576, "្រី": 391, "អាច": 675, "ភាព": 382, "នេះ": 412, "ាតិ": 452, "ទេស": 484, "ពីរ": 209, "និង": 489, "្សា": 342, "ពេល": 293, "នុង": 404, "មិន": 405, "ទោះ": -556, "ីឡា": 235, "្ថា": -496, "រុម": 95, "សភា": 139, "បចំ": 152, "អ្ន": -101, "រឹង": -100, "ូមិ": 74, "នឹង": 37, "ៅស្": 49, "ឺជា": 12, "តាម": 12 }, "BW2": { "ាន": -403, "ារ": -358, "រប": -228, "ំព": -507, "ាម": -105, "ាក": 141, "យក": -104, "ីរ": -232, "ាយ": -295, "ែល": -120, "សម": -227, "ូវ": -232, "េស": -213, "ះអ": -101, "ីអ": -50, "រន": 37, "ីស": -12 }, "TW2": { "ការ": -1074, "ជាម": -457, "ាយក": -314, "ោកស": -412, "ពីរ": -321, "ោកជ": -267 }, "TW3": { "យសា": -1431, "ាមួ": -545, "ាតិ": -703, "ចក្": -337, "របស": -391, "កស្": -94, "កម្": -94, "ទទួ": -292, "់គ្": -105, "រពា": -79, "ៅក្": -150, "វបា": -86 } };

const model = new Map(
  Object.entries(MODEL_DICT).map(([k, v]) => [k, new Map(Object.entries(v))])
)

const baseScore =
  -0.5 *
  [...model.values()]
    .map(group => [...group.values()])
    .flat()
    .reduce((prev, curr) => prev + curr, 0);

function parse(sentence) {
  if (sentence === '') return [];
  const boundaries = parseBoundaries(sentence);
  const result = [];
  let start = 0;
  for (const boundary of boundaries) {
    result.push(sentence.slice(start, boundary));
    start = boundary;
  }
  result.push(sentence.slice(start));
  return result;
}

function parseBoundaries(sentence) {
  const result = [];
  for (let i = 1; i < sentence.length; i++) {
    let score = baseScore;
    score += model.get('UW1')?.get(sentence.substring(i - 3, i - 2)) || 0;
    score += model.get('UW2')?.get(sentence.substring(i - 2, i - 1)) || 0;
    score += model.get('UW3')?.get(sentence.substring(i - 1, i)) || 0;
    score += model.get('UW4')?.get(sentence.substring(i, i + 1)) || 0;
    score += model.get('UW5')?.get(sentence.substring(i + 1, i + 2)) || 0;
    score += model.get('UW6')?.get(sentence.substring(i + 2, i + 3)) || 0;
    score += model.get('BW1')?.get(sentence.substring(i - 2, i)) || 0;
    score += model.get('BW2')?.get(sentence.substring(i - 1, i + 1)) || 0;
    score += model.get('BW3')?.get(sentence.substring(i, i + 2)) || 0;
    score += model.get('TW1')?.get(sentence.substring(i - 3, i)) || 0;
    score += model.get('TW2')?.get(sentence.substring(i - 2, i + 1)) || 0;
    score += model.get('TW3')?.get(sentence.substring(i - 1, i + 2)) || 0;
    score += model.get('TW4')?.get(sentence.substring(i, i + 3)) || 0;
    if (score > 0) result.push(i);
  }
  return result;
}

module.exports = parse